Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 52)]              0         
                                                                 
 token_and_position_embeddi  (None, 52, 32)            2464      
 ng (TokenAndPositionEmbedd                                      
 ing)                                                            
                                                                 
 transformer_block (Transfo  (None, 52, 32)            8544      
 rmerBlock)                                                      
                                                                 
 transformer_block_1 (Trans  (None, 52, 32)            8544      
 formerBlock)                                                    
                                                                 
 global_average_pooling1d (  (None, 32)                0         
 GlobalAveragePooling1D)                                         
                                                                 
 dropout_7 (Dropout)         (None, 32)                0         
                                                                 
 dense_4 (Dense)             (None, 512)               16896     
                                                                 
 dropout_8 (Dropout)         (None, 512)               0         
                                                                 
 dense_5 (Dense)             (None, 128)               65664     
                                                                 
 dropout_9 (Dropout)         (None, 128)               0         
                                                                 
 dense_6 (Dense)             (None, 64)                8256      
                                                                 
 dropout_10 (Dropout)        (None, 64)                0         
                                                                 
 dense_7 (Dense)             (None, 1)                 65        
                                                                 
=================================================================
Total params: 110433 (431.38 KB)
Trainable params: 110433 (431.38 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
